RoboStar82/robot/include/config/weact_mini_stm32h743vit6.h

#ifdef ARDUINO_WEACT_MINI_H743VIT6

#define ROBOT_HAS_LED
#define ROBOT_HAS_LORA
#define ROBOT_HAS_LORA_FSK
// #define ROBOT_HAS_TFLM
// #define ROBOT_HAS_PYTHON
// #define ROBOT_HAS_SCRIPT
// #define ROBOT_HAS_DISPLAY
// #define ROBOT_HAS_DISPLAY_ST7735
// #define ROBOT_HAS_DISPLAY_GDEY0213Z98
// #define ROBOT_HAS_CAMERA
// #define ROBOT_HAS_CAMERA_OV2640
#define ROBOT_HAS_CONTROLLER
#define ROBOT_HAS_CONTROLLER_LORA
// #define ROBOT_HAS_READER
// #define ROBOT_HAS_WRITER

#define LORA_NSS_PIN PB12
#define LORA_SCK_PIN PB13
#define LORA_MISO_PIN PB14
#define LORA_MOSI_PIN PB15
#define LORA_NRST_PIN PD10
#define LORA_BUSY_PIN PD8
#define LORA_DIO1_PIN PD9

#define DISPLAY_ST7735_LED_PIN PE10
#define DISPLAY_ST7735_CS_PIN PE11
#define DISPLAY_ST7735_SCK_PIN PE12
#define DISPLAY_ST7735_DC_PIN PE13
#define DISPLAY_ST7735_MOSI_PIN PE14
#define DISPLAY_ST7735_RST_PIN -1

// #define DISPLAY_GDEY0213Z98_CS_PIN PB4
// #define DISPLAY_GDEY0213Z98_DC_PIN PB10
// #define DISPLAY_GDEY0213Z98_RST_PIN PB11
// #define DISPLAY_GDEY0213Z98_BUSY_PIN PB12
// #define DISPLAY_GDEY0213Z98_SCK_PIN PB13
// #define DISPLAY_GDEY0213Z98_MOSI_PIN PB15
// #define DISPLAY_GDEY0213Z98_MISO_PIN PB14

#define CAMERA_OV2640_SDA_PIN PB9
#define CAMERA_OV2640_SCL_PIN PB8
#define CAMERA_OV2640_PWDN_PIN PA7
#define CAMERA_OV2640_XCLK_PIN PA8
#define CAMERA_OV2640_VSYNC_PIN PB7
#define CAMERA_OV2640_HSYNC_PIN PA4
#define CAMERA_OV2640_PCLK_PIN PA6
#define CAMERA_OV2640_D0_PIN PC6
#define CAMERA_OV2640_D1_PIN PC7
#define CAMERA_OV2640_D2_PIN PE0
#define CAMERA_OV2640_D3_PIN PE1
#define CAMERA_OV2640_D4_PIN PE4
#define CAMERA_OV2640_D5_PIN PD3
#define CAMERA_OV2640_D6_PIN PE5
#define CAMERA_OV2640_D7_PIN PE6
#define CAMERA_OV2640_IMAGE_WIDTH 352
#define CAMERA_OV2640_IMAGE_HEIGHT 288
#define CAMERA_OV2640_YUV422

#endif
